; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph10 - mode
	thermograph9 - mode
	thermograph8 - mode
	spectrograph2 - mode
	infrared1 - mode
	thermograph7 - mode
	thermograph3 - mode
	thermograph0 - mode
	spectrograph5 - mode
	thermograph4 - mode
	thermograph6 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph10)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph10)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph9)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph5)
	(supports instrument2 thermograph7)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph6)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph9)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument4 thermograph3)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph4)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph10)
	(supports instrument5 thermograph3)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
)
(:goal (and
	(pointing satellite1 GroundStation2)
	(have_image Star5 spectrograph2)
	(have_image Planet6 thermograph0)
	(have_image Planet6 thermograph9)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 thermograph9)
	(have_image Star8 thermograph0)
	(have_image Star8 spectrograph5)
	(have_image Star9 thermograph7)
))

)

; plan
1. (turn_to satellite3 groundstation1 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 10
3. (calibrate satellite3 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 10
4. (turn_to satellite3 planet6 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet6)
   goals met: 0 of 10
5. (take_image satellite3 planet6 instrument6 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite3 phenomenon7 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon7)
   goals met: 1 of 10
7. (turn_to satellite0 groundstation4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 10
8. (take_image satellite3 phenomenon7 instrument6 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 2 of 10
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 10
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 10
11. (calibrate satellite1 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 2 of 10
12. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 10
13. (turn_to satellite0 planet6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet6)
   goals met: 2 of 10
14. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 3 of 10
15. (take_image satellite0 planet6 instrument1 thermograph9)
   added: (have_image planet6 thermograph9)
   goals met: 4 of 10
16. (turn_to satellite0 star8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star8)
   goals met: 4 of 10
17. (take_image satellite0 star8 instrument1 thermograph9)
   added: (have_image star8 thermograph9)
   goals met: 5 of 10
18. (turn_to satellite1 star8 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star8)
   goals met: 5 of 10
19. (take_image satellite1 star8 instrument2 spectrograph5)
   added: (have_image star8 spectrograph5)
   goals met: 6 of 10
20. (turn_to satellite1 star9 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star9)
   goals met: 6 of 10
21. (take_image satellite1 star9 instrument2 thermograph7)
   added: (have_image star9 thermograph7)
   goals met: 7 of 10
22. (turn_to satellite1 groundstation2 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation2)
   goals met: 8 of 10
23. (turn_to satellite3 star5 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star5)
   goals met: 8 of 10
24. (take_image satellite3 star5 instrument6 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 9 of 10
25. (turn_to satellite3 star8 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star8)
   goals met: 9 of 10
26. (take_image satellite3 star8 instrument6 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 10 of 10
